In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:root@localhost/

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

### String Handling

In [4]:
%%sql
use uber

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql
show tables

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('customerTransactions',),
 ('customerdata',),
 ('drivers',),
 ('rides',),
 ('test',),
 ('user',)]

In [12]:
%%sql
select * from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876543211', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '9876543212', None, Decimal('3000.00'))]

In [9]:
%%sql
-- Length of string in the customer data name 
select length(customer_name) as length from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[(4,), (5,), (5,), (5,), (7,)]

In [13]:
%%sql
select upper(address) as address_name_in_upper from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('CHENNAI',), ('BANGALORE',), ('HYDERABAD',), ('MUMBAI',), (None,)]

In [14]:
%%sql
select lower(address) as address_name_in_lower from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('chennai',), ('bangalore',), ('hyderabad',), ('mumbai',), (None,)]

In [15]:
%%sql
select concat(customer_name," The city of  ",address) as name_with_address from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi The city of  Chennai',),
 ('Priya The city of  Bangalore',),
 ('Arjun The city of  Hyderabad',),
 ('Meena The city of  Mumbai',),
 (None,)]

In [17]:
%%sql
-- (value , start, end ) params for substring
select substring(address,1,3) as sub from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Che',), ('Ban',), ('Hyd',), ('Mum',), (None,)]

In [20]:
%%sql
-- remove all white spaces from the string 
select trim("   abu   ")

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('abu',)]

In [30]:
%%sql
-- padding right
select rpad("abu",15,'*');

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('abu************',)]

In [31]:
%%sql
-- padding left
select lpad("abu",15,'*')

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('************abu',)]

In [33]:
%%sql
select replace(customer_name,'a','-') as updated_name from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('R-vi',), ('Priy-',), ('Arjun',), ('Meen-',), ('K-rthik',)]

In [37]:
%%sql
-- to see the position of some character
select instr(customer_name,'a') as position_of_a from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[(2,), (5,), (1,), (5,), (2,)]

In [42]:
%%sql
select left(customer_name,3) as first_3_characters from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Rav',), ('Pri',), ('Arj',), ('Mee',), ('Kar',)]

In [41]:
%%sql
select right(customer_name,3) as last_3_characters from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('avi',), ('iya',), ('jun',), ('ena',), ('hik',)]

In [44]:
%%sql
select reverse(customer_name) as reversed_name from customerdata;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('ivaR',), ('ayirP',), ('nujrA',), ('aneeM',), ('kihtraK',)]

In [48]:
%%sql
select format(987654321,2) as format_number

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('987,654,321.00',)]

In [49]:
%%sql
-- nested functions usage
select upper(concat(customer_name," The city of  ",address)) as name_with_address from customerdata

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('RAVI THE CITY OF  CHENNAI',),
 ('PRIYA THE CITY OF  BANGALORE',),
 ('ARJUN THE CITY OF  HYDERABAD',),
 ('MEENA THE CITY OF  MUMBAI',),
 (None,)]